src/cf/Documents/ДанныеДокументаМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДанныеДокументаМЭДО</Name>
			<Comment>Дополнительная детализация документа для МЭДО</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументовМЭДО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйФайл</Name>
					<Comment>Главный документ из сообщения, остальные - приложения к нему</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовКОтправке</Name>
					<Comment>Для исходящего</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Comment>Для входящего - из паспорта сообщения, для исходящего - GUID из ссылки на документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаСоставленияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтветственныйМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Для исходящего</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущаяОтправка</Name>
					<Comment>Для повторной отправки одного этого же документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСостояние</Name>
					<Comment>Для отбора в списке</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияМЭДО</Name>
					<Comment>Удален в релизе 3.0.11</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторСообщения</Name>
					<Comment>Удален в релизе 3.0.11</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пакеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияМЭДО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВерсииФорматаМЭДО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/НаправленияСообщенийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияСообщенийМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ДанныеДокументаМЭДО/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииНаСервереРедакцииКонфигурации();
	
	// Открытие из формы:
	Если Объект.Ссылка.Пустая() И Параметры.ЭтоПрограммноеСоздание Тогда
		
		Документ = Параметры.Документ; // ОпределяемыйТип.ПредметМЭДО
		Объект.Документ = Документ;
		Если МЭДОПереопределяемый.ЭтоИсходящийДокумент(Объект.Документ) Тогда
			Объект.ИдентификаторДокумента = "" + Объект.Документ.УникальныйИдентификатор();
			Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее;
		ИначеЕсли МЭДОПереопределяемый.ЭтоВходящийДокумент(Объект.Документ) Тогда 
			Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее;
		КонецЕсли;
		Реквизиты = МЭДОПереопределяемый.ТребуемыеДанныеВходящегоДокумента(
			Объект.Документ, "Организация", МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
		Объект.Организация = Реквизиты.Организация;
		
		Модифицированность = Истина;
	КонецЕсли;
	
	УправлениеДоступностьюВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбщегоНазначенияДокументооборот.ПоказатьНадписьПометкиУдаления(ЭтотОбъект, ТекущийОбъект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьПредметМэдоОЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГотовКОтправкеПриИзменении(Элемент)
	
	Элементы.ОтправитьПоМЭДО.Доступность = Объект.ГотовКОтправке;
	
КонецПроцедуры

&НаКлиенте
Процедура ГлавныйФайлАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = ФайлыПодходящиеДляМЭДО(Объект.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ГлавныйФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПоМЭДО(Команда)
	
	ОчиститьСообщения();
	
	Если Не Объект.ГотовКОтправке Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Необходимо установить флаг ""Готов к отправке""'"),
			Объект.Ссылка,
			"ГотовКОтправке",
			"Объект");
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда 
		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеОтвета = МЭДОКлиент.НовыйЛегкийОтвет();
	МЭДОВызовСервера.ОтправитьИсходящиеДокументы(
		Объект.Организация,
		ДанныеОтвета,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Документ));
	
	МЭДОКлиент.ПоказатьРезультатОтправки(НСтр("ru = 'Документ отправлен'"), ДанныеОтвета);
	Прочитать();
	Элементы.ОтправитьПоМЭДО.Доступность = Объект.ГотовКОтправке;
	ОповеститьПредметМэдоОЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДоступностьюВидимостью()
	
	ЕстьПолныеПрава = Пользователи.ЭтоПолноправныйПользователь();
	Элементы.ОтправитьПоМЭДО.Доступность = Объект.ГотовКОтправке;
	Если Не ЕстьПолныеПрава Тогда
		Элементы.ГруппаТехническиеДанные.Видимость = Ложь;
		Элементы.ПредыдущаяОтправка.ТолькоПросмотр = Истина;
		Элементы.ПредыдущаяОтправка.Видимость = Объект.ПредыдущаяОтправка;
	КонецЕсли;
	
	// Эти поля изменяются только программно, данные редактируются из исходной формы документа:
	Элементы.ЛеваяКолонка.ТолькоПросмотр = Не ЕстьПолныеПрава;
	Элементы.Ответственный.ТолькоПросмотр = Не ЕстьПолныеПрава;
	
	ЭтоИсходящее = (Объект.Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее);
	Элементы.ГотовКОтправке.Видимость = ЭтоИсходящее;
	Элементы.Отправлен.Видимость = ЭтоИсходящее;
	Элементы.ОтправитьПоМЭДО.Видимость = ЭтоИсходящее;
	
	ПакетовНесколько = Объект.Пакеты.Количество() > 1;
	Элементы.Пакеты.Видимость = ПакетовНесколько;
	Элементы.ИдентификаторСообщения.Видимость = Не ПакетовНесколько;
	Элементы.ВерсияМЭДО.Видимость = Не ПакетовНесколько;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФайлыПодходящиеДляМЭДО(Документ)
	
	СписокВыбора = Новый СписокЗначений();
	ТзОбычные = МЭДОПереопределяемый.ОбычныеФайлыДокумента(Документ, Неопределено);
	Для Каждого С Из ТзОбычные Цикл
		Если СтрНайти(НРег(С.Расширение), "pdf") > 0 Тогда
			СписокВыбора.Добавить(С.Файл, С.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервереРедакцииКонфигурации()
	
	Элементы.Организация.Заголовок = МЭДОПереопределяемый.Организация();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПредметМэдоОЗаписи()
	
	Отклик = Новый Структура();
	Отклик.Вставить("ПредметСообщения", Объект.Ссылка);
	Отклик.Вставить("Документ", Объект.Документ);
	Оповестить("Запись_ДанныеДокументаМЭДО", Отклик, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
